<html>
<head>
<title>OpenPetra.org Bemerkungen zur Vorschauversion</title>
</head>
<body>
Besuchen Sie bitte die Projektwebseite <a href="http://www.openpetra.org">http://www.openpetra.org</a>, um mehr Informationen zu erhalten!<br/>
Bitte melden Sie Probleme mit der neuesten Version im Forum: <a href="http://forum.openpetra.org">http://forum.openpetra.org</a><br/>

<h2>Bemerkungen zu den Vorschauversionen von OpenPetra.org</h2>

<h3>0.0.12.0: 15. Februar 2010</h3>
Bitte beachten Sie auch die vorherigen Notizen, die unten zu finden sind!<br/>
<br/>
OpenPetra funktioniert jetzt auch mit Mysql, so wie es schon mit Postgresql und Sqlite funktioniert.<br/>
Der Remote Client installiert jetzt auch auf Windows Vista, und das automatische Updaten funktioniert auch dort (Windows 7 sollte auch tun).<br/>
Die OpenPetra Datenbank kann jetzt als Textdatei exportiert werden, und in eine andere OpenPetra Instanz installiert werden. Das erm&ouml;glicht die einfache Mitnahme von Daten von einer Einzelplatzversion auf eine gehostete Version, oder zur Migration zwischen unterschiedlichen Datenbanktypen.<br/>
Das automatische Wiedererkennen von Spenden funktioniert jetzt.<br/>
Man kann jetzt Spendenbescheinigungen (ein Serienbrief) drucken.<br/>

<h3>0.0.11.0: 11. Januar 2010</h3>
Bitte beachten Sie auch die vorherigen Notizen, die unten zu finden sind!<br/>
<br/>
Mit dieser Version kann man bereits existierende Stammdaten aus einer Yml Datei importieren.<br/>
Das automatische Aktualisieren der Clients funktioniert jetzt.<br/>
Die vernetzte Version von OpenPetra benutzt jetzt verschl&uuml;sselte Kommunikation, um die Sicherheit zu gew&auml;hrleisten.<br/>
Es ist jetzt m&ouml;glich, ein Plugin zu entwickeln, um die Benutzerauthentifizierung mit LDAP oder phpBB oder einem anderen Dienst durchzuf&uuml;hren.<br/>

<h3>0.0.10.0: 13. November 2009</h3>
Bitte beachten Sie auch die vorherigen Notizen, die unten zu finden sind!<br/>
<br/>
Kontohierarchie kann jetzt importiert werden. Neue Konten werden automatisch erzeugt. Dadurch wird die Anpassung von OpenPetra an die spezifischen Bed&uuml;rfnisse einer Organisation vereinfacht.<br/>
Das Importieren von Wechselkursen f&uur; Fremdw&auml;hrungen funktioneirt jetzt. Dadurch wird es m&ouml;glich, Berichte auch in einer internationalen W&auml;hrung anzuzeigen, damit sie von den Managern in der Zentrale einfacher verstanden werden k&ouml;nnen.<br/>
Berichte f&uuml;r Einkommen/Ausgaben und Bilanzen und Auflistung der detailierten Geldbewegungen funktionierten jetzt und wurden auch soweit getested. Nat&uuml;rlich k&ouml;nnen sie noch weiter verbessert werden, z.B. dass der Benutzer selber die Spaltenanordnung und -inhalte bestimmen kann, und dass &uuml;ber ein Quartal berichtet werden kann, usw.<br/>
Finanztransaktionen k&ouml;nnen jetzt aus Excel via CSV Dateien importiert werden, in denen jede Spalte f&uuml;r eine bestimmte Kategorie steht, und wenn ein Wert in dieser Spalte eingetragen ist, wird er auf das entsprechende Konto gebucht. Eine Datendefinitionsdatei enth&auml;lt Hinweise auf das Datumsformat und das Format der Betr&auml;ge, und die Kontennamen pro Spalte. Dank dieser Funktionalit&auml;t kann das Importieren leicht an andere Umgebungen angepasst werden. Im vorliegenden Fall benutzen wir es, um bestehende Abrechnungen eines anderen B&uuml;ros zu importieren.<br/>

<h3>0.0.9.0: 12. Oktober 2009</h3>
Bitte beachten Sie auch die vorherigen Notizen, die unten zu finden sind!<br/>
<br/>
Rechnungen k&ouml;nnen jetzt bezahlt werden, und sie werden gleich in GL verbucht. Es geht leider noch nicht, Rechnungen nur teilweise zu bezahlen, und Zahlungen in Fremdw&auml;hrungen werden auch noch nicht unterst&uuml;tzt.<br/>
Die Hierarchie der Kontenbl&auml;tter kann jetzt in einem Baum angezeigt werden, und neue Konten k&ouml;nnen hinzugef&uuml;gt werden. Man kann noch nicht die Konten innerhalb der Hierarchie verschieben, und man kann auch noch keine Konten l&ouml;schen.<br/>
Man kann die Kontenhierarchie jetzt in die Dateiformate CSV, YML und XML exportieren. Dadurch wird es m&ouml;glich, die Kontenhierarchie auch ausserhalb von OpenPetra zu bearbeiten, und zwischen OpenPetra System auszutauschen. Das Importieren dieser Dateien funktioniert allerdings noch nicht.<br/>

<h3>0.0.8.0: 21. September 2009</h3>
Bitte beachten Sie auch die vorherigen Notizen, die unten zu finden sind!<br/>
<br/>
AP Rechnungen k&ouml;nnen jetzt verbucht werden.<br/>
Das neue Navigationssystem funktioniert im Prinzip, obwohl es bald noch erweitert werden sollte, damit die Benutzer es an eigene Bed&uuml;rfnisse anpassen k&ouml;nnen, und auch Suchboxen sollen das Suchen stark vereinfachen.<br/>
Ein neuer Demo Ordner wurde im neuen Navigationssystem erstellt, damit man die funktionierenden Teile von OpenPetra schnell erreichen kann.<br/>
Das klassische Navigationssystem mit den tief verzweigten Men&uuml;strukturen ist immer noch verf&uuml;gbar, es ist &uuml;ber einen Befehl in der Symbolleiste zu erreichen.

<h3>0.0.7.0: 05. September 2009</h3>
Bitte beachten Sie auch die vorherigen Notizen, die unten zu finden sind!<br/>
<br/>
Ein paar Fehler in der vorherigen Version im Partner Edit und Partner Find Bildschirm wurden behoben.<br/>
Diese Bildschirme sollten jetzt auch auf Linux und Mac besser funktionieren.<br/>
Man kann jetzt GL Batches buchen!<br/>
Es gibt jetzt den Account Details Bericht, mit dem man die gebuchten Transaktionen und neuen Bilanzen pr&uuml;fen kann.<br/>

<h3>0.0.6.0: 19. August 2009</h3>
Bitte beachten Sie auch die vorherigen Notizen, die unten zu finden sind!<br/>
<br/>
Der Bildschirm zum Verwalten aller Gesch&auml;ftsvorg&auml;nge sieht jetzt schon recht gut aus, und man kann Batches, Journale und die einzelnen
Gesch&auml;ftsvorg&auml;nge speichern. Man kann Kostenstellen und Konten f&uuml;r die Gesch&auml;ftsvorg&auml;nge ausw&auml;hlen.
<br/><br/>
Ein paar Verbesserungen im Accounts Payable Module sollten die Fehlermeldungen der vorherigen Version beheben.

<h3>0.0.5.0: 25. Juli 2009</h3>
Bitte beachten Sie auch die vorherigen Notizen, die unten zu finden sind!<br/>
<br/>
Jetzt kann man schon Rechnungen im Accounts Payable Modul anlegen und Rechnungsdetails hinzuf&uuml;gen, und es alles speichern.
Dann kann man nach dem Lieferanten suchen, und die Rechnungen und Gutschriften des Lieferanten &ouml;ffnen.
<br/>
Es gibt eine erste Vorschau des Bildschirms f&uuml;r allgemeine Zahlungsvorg&auml;nge im Hauptbuch. Der Bildschirm hat aber noch keine Funktionalit&auml;t.
<br/>
Ausserdem gibt es eine erste Vorschau von einfachen Wartungsbildschirmen, zum Beispiel f&uuml;r das Verwalten der W&auml;hrungen und der Wechselkurse. Auch hier gibt es noch keine Funktionalit&auml;t.
<br/><br/>
Der Sinn dieser Vorschaubildschirme ist es, zu zeigen, wie einfach man mit dem Scaffolding neue Bildschirme anlegen kann. Im Accounts Payable Modul ist es so ausprogrammiert, dass die Funktionalit&auml;t
schon weitestgehend automatisch erzeugt wird, und nur kleine Sonderf&auml;lle ausprogrammiert werden m&uuml;ssen.

<h3>0.0.4.0: 13. Juli 2009</h3>
Die wichtigste Neuerung ist im Rechnungssystem, dass man Lieferanten anlegen kann. Um dies zu testen, muss man erst im Partnermodul einen Partner vom Typ Organisation anlegen,
und dann ins Finanzmodul gehen, und dort Accounts Payable w&auml;hlen, und dort auf New Supplier klicken.
Man kann den Lieferanten speichern, und auch wieder danach suchen, mit Namen oder Partnerschl&uuml;ssel. Das Suchfenster merkt sich die letzten 30 Suchbegriffe und erg&auml;nzt automatisch.
<br/>
Vorschaufenster vom Bildschirm zum Bearbeiten von Rechnungen und der Liste aller Rechnungen eines Lieferanten sind ebenfalls zu sehen, aber haben noch keine Funktionalit&auml;t.
<br/><br/>
Einige kleinere Fehler wurde korrigiert, z.B. im Partner Edit Bildschirm wurde der Fehler behoben, wenn &Auml;nderungen beim Schliessen des Fenster gespeichert werden sollen.
Im Partner Find Bildschirm kann man direkt mit der Return Taste die Suche ausl&ouml;sen.
<br/><br/>
In dieser Version sollte auch wieder die PostgreSQL Unterst&uuml;tzung laufen, die ist in 0.0.3 kaputt gegangen.
<br/><br/>
Diese Version gibt es nicht nur als Windows Einzelplatzversion, sondern es gibt jetzt auch eine Version des OpenPetra Servers f&uuml;r Linux.
Im Moment funktioniert diese Version nur mit PostgreSQL. Siehe auch die Datei INSTALL im tar.gz Archiv.
Weiterhin gibt es jetzt ein Remote Client Installationsprogramm, damit man einen OpenPetra Client installieren kann, der sich mit einem OpenPetra Server auf Linux verbindet.

<h3>0.0.3.0: 20. Juni 2009</h3>
Eine gro&szlig;e Neuigkeit ist, dass &Uuml;bersetzungen jetzt funktionieren, und der Petra Client wird jede Sprachdatei die in diesem Verzeichnis, z.B. C:\Programme\OpenPetra.org\bin30\locale\de\LC_MESSAGES\i18n.mo existiert, benutzen.
Man muss evtl. die Umgebungsvariable LANGUAGE unter Windows Systemeinstellungen entsprechend setzen, um eine andere Sprache nutzen zu k&ouml;nnen.
Mithilfe beim &Uuml;bersetzen ist erw&uuml;nscht! Bitte folgen Sie im <a href="http://sourceforge.net/apps/mediawiki/openpetraorg/index.php?title=HowTo_help_with_Translation">Wiki den entsprechenden Anleitungen</a>!
<br/><br/>
Das Finanzmodul kann man jetzt &ouml;ffnen, und 2 Vorschaubildschirme k&ouml;nnen ge&ouml;ffnet werden: Einmal zum Zuweisen von Spenden aus Kontoausz&uuml;gen, und ein anderer ist der Hauptbildschirm des Account Payable, zum Bezahlen von Rechnungen.
<br/><br/>
Es wird wohl sein, dass Ihre Datenbank ersetzt werden wird, aber die gesicherte alte Datenbank ist immer noch hier: z.B. eg. C:\Dokumente und Einstellungen\[Benutzername]\Anwendungsdaten\OpenPetra.org\db30\petra.db.1.bak; 
Wir hoffen, bald ein richtiges Updatesystem bereitstellen zu k&ouml;nnen.
<br/><br/>
Einige der Probleme der vorherigen Versionen wurden behoben, z.b. das Datum beim St&auml;dtebericht sollte jetzt behoben sein.

<h3>0.0.2.0: 13 Juni 2009</h3>
Die wichtigste Neuerung ist der &quot;Partner By City&quot; Bericht. Um diesen Bericht auszuprobieren, 
einfach ein paar Partner im Partner Edit Bildschirm anlegen, und dann den Bericht auf diesen St&auml;dten laufen lassen.
Im Moment funktioniert der Bericht nur f&uuml;r Partner vom Typ FAMILY; und es scheint auch ein Fehler zu existieren: 
Adressen, die erst ab heute g&uuml;ltig sind, werden im Bericht nicht angezeigt; L&ouml;sung: einfach das Datum bei der Adresse auf gestern oder fr&uuml;her setzen!
<br/><br/>
Eine weitere hilfreiche Erweiterung ist die untere Leiste auf jedem Bildschirm, die einen Hilfetext f&uuml;r das momentan selektierte Feld anzeigt.
Dies kann zum Beispiel auf dem Partner Edit Bildschirm sehr hilfreich sein, damit man weiss welche Bedeutung die verschiedenen Felder haben.

<h3>0.0.1.3: 1 Juni 2009</h3>
Dies ist die erste Ver&ouml;ffentlichung von OpenPetra.org.<br/>
Es gibt momentan nur eine Einzelplatzversion, die SQLite benutzt, um die Installation so einfach wie m&ouml;glich zu gestalten.<br/>
<br/>
Man meldet sich mit dem Benutzernamen <b>demo</b> an, und das Passwort ist ebenfalls <b>demo</b>.<br/>
<br/>
Es gibt momentan nur 2 Bildschirme, die tats&auml;chlich funktionieren:<br/>
Gehen Sie in das Partner Modul, und im Men&uuml; w&auml;hlen Sie &quot;Partner&quot; / &quot;Neuer Partner&quot;.<br/>
Dort k&ouml;nnen Sie einen neuen Partner anlegen, eine Adresse hinzuf&uuml;gen, und den Partner speichern.<br/>
<br/>
Dann k&ouml;nnen Sie auf dem Hauptschirm vom Partner Modul im Men&uuml; &quot;Partner&quot; - &quot;Suchen & Bearbeiten&quot; w&auml;hlen.<br/>
Suchen Sie nach dem Partner, den Sie vorhin angelegt haben.<br/>
Wenn Sie auf das Ergebnis doppelklicken, wird der Partner wieder zum Bearbeiten ge&ouml;ffnet.<br/>
</body>
</html>